GopalSaraf/Practicals/PSDL/include/proc/pic18lf27k42.h
// Register: SMT1TMRU
#define SMT1TMRU SMT1TMRU
extern volatile unsigned char           SMT1TMRU            __at(0x3F14);
#ifndef _LIB_BUILD
asm("SMT1TMRU equ 03F14h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned TMR                    :8;
    };
    struct {
        unsigned TMR16                  :1;
        unsigned TMR17                  :1;
        unsigned TMR18                  :1;
        unsigned TMR19                  :1;
        unsigned TMR20                  :1;
        unsigned TMR21                  :1;
        unsigned TMR22                  :1;
        unsigned TMR23                  :1;
    };
    struct {
        unsigned SMT1TMR                :8;
    };
    struct {
        unsigned SMT1TMR16              :1;
        unsigned SMT1TMR17              :1;
        unsigned SMT1TMR18              :1;
        unsigned SMT1TMR19              :1;
        unsigned SMT1TMR20              :1;
        unsigned SMT1TMR21              :1;
        unsigned SMT1TMR22              :1;
        unsigned SMT1TMR23              :1;
    };
} SMT1TMRUbits_t;
extern volatile SMT1TMRUbits_t SMT1TMRUbits __at(0x3F14);
// bitfield macros
#define _SMT1TMRU_TMR_POSN                                  0x0
#define _SMT1TMRU_TMR_POSITION                              0x0
#define _SMT1TMRU_TMR_SIZE                                  0x8
#define _SMT1TMRU_TMR_LENGTH                                0x8
#define _SMT1TMRU_TMR_MASK                                  0xFF
#define _SMT1TMRU_TMR16_POSN                                0x0
#define _SMT1TMRU_TMR16_POSITION                            0x0
#define _SMT1TMRU_TMR16_SIZE                                0x1
#define _SMT1TMRU_TMR16_LENGTH                              0x1
#define _SMT1TMRU_TMR16_MASK                                0x1
#define _SMT1TMRU_TMR17_POSN                                0x1
#define _SMT1TMRU_TMR17_POSITION                            0x1
#define _SMT1TMRU_TMR17_SIZE                                0x1
#define _SMT1TMRU_TMR17_LENGTH                              0x1
#define _SMT1TMRU_TMR17_MASK                                0x2
#define _SMT1TMRU_TMR18_POSN                                0x2
#define _SMT1TMRU_TMR18_POSITION                            0x2
#define _SMT1TMRU_TMR18_SIZE                                0x1
#define _SMT1TMRU_TMR18_LENGTH                              0x1
#define _SMT1TMRU_TMR18_MASK                                0x4
#define _SMT1TMRU_TMR19_POSN                                0x3
#define _SMT1TMRU_TMR19_POSITION                            0x3
#define _SMT1TMRU_TMR19_SIZE                                0x1
#define _SMT1TMRU_TMR19_LENGTH                              0x1
#define _SMT1TMRU_TMR19_MASK                                0x8
#define _SMT1TMRU_TMR20_POSN                                0x4
#define _SMT1TMRU_TMR20_POSITION                            0x4
#define _SMT1TMRU_TMR20_SIZE                                0x1
#define _SMT1TMRU_TMR20_LENGTH                              0x1
#define _SMT1TMRU_TMR20_MASK                                0x10
#define _SMT1TMRU_TMR21_POSN                                0x5
#define _SMT1TMRU_TMR21_POSITION                            0x5
#define _SMT1TMRU_TMR21_SIZE                                0x1
#define _SMT1TMRU_TMR21_LENGTH                              0x1
#define _SMT1TMRU_TMR21_MASK                                0x20
#define _SMT1TMRU_TMR22_POSN                                0x6
#define _SMT1TMRU_TMR22_POSITION                            0x6
#define _SMT1TMRU_TMR22_SIZE                                0x1
#define _SMT1TMRU_TMR22_LENGTH                              0x1
#define _SMT1TMRU_TMR22_MASK                                0x40
#define _SMT1TMRU_TMR23_POSN                                0x7
#define _SMT1TMRU_TMR23_POSITION                            0x7
#define _SMT1TMRU_TMR23_SIZE                                0x1
#define _SMT1TMRU_TMR23_LENGTH                              0x1
#define _SMT1TMRU_TMR23_MASK                                0x80
#define _SMT1TMRU_SMT1TMR_POSN                              0x0
#define _SMT1TMRU_SMT1TMR_POSITION                          0x0
#define _SMT1TMRU_SMT1TMR_SIZE                              0x8
#define _SMT1TMRU_SMT1TMR_LENGTH                            0x8
#define _SMT1TMRU_SMT1TMR_MASK                              0xFF
#define _SMT1TMRU_SMT1TMR16_POSN                            0x0
#define _SMT1TMRU_SMT1TMR16_POSITION                        0x0
#define _SMT1TMRU_SMT1TMR16_SIZE                            0x1
#define _SMT1TMRU_SMT1TMR16_LENGTH                          0x1
#define _SMT1TMRU_SMT1TMR16_MASK                            0x1
#define _SMT1TMRU_SMT1TMR17_POSN                            0x1
#define _SMT1TMRU_SMT1TMR17_POSITION                        0x1
#define _SMT1TMRU_SMT1TMR17_SIZE                            0x1
#define _SMT1TMRU_SMT1TMR17_LENGTH                          0x1
#define _SMT1TMRU_SMT1TMR17_MASK                            0x2
#define _SMT1TMRU_SMT1TMR18_POSN                            0x2
#define _SMT1TMRU_SMT1TMR18_POSITION                        0x2
#define _SMT1TMRU_SMT1TMR18_SIZE                            0x1
#define _SMT1TMRU_SMT1TMR18_LENGTH                          0x1
#define _SMT1TMRU_SMT1TMR18_MASK                            0x4
#define _SMT1TMRU_SMT1TMR19_POSN                            0x3
#define _SMT1TMRU_SMT1TMR19_POSITION                        0x3
#define _SMT1TMRU_SMT1TMR19_SIZE                            0x1
#define _SMT1TMRU_SMT1TMR19_LENGTH                          0x1
#define _SMT1TMRU_SMT1TMR19_MASK                            0x8
#define _SMT1TMRU_SMT1TMR20_POSN                            0x4
#define _SMT1TMRU_SMT1TMR20_POSITION                        0x4
#define _SMT1TMRU_SMT1TMR20_SIZE                            0x1
#define _SMT1TMRU_SMT1TMR20_LENGTH                          0x1
#define _SMT1TMRU_SMT1TMR20_MASK                            0x10
#define _SMT1TMRU_SMT1TMR21_POSN                            0x5
#define _SMT1TMRU_SMT1TMR21_POSITION                        0x5
#define _SMT1TMRU_SMT1TMR21_SIZE                            0x1
#define _SMT1TMRU_SMT1TMR21_LENGTH                          0x1
#define _SMT1TMRU_SMT1TMR21_MASK                            0x20
#define _SMT1TMRU_SMT1TMR22_POSN                            0x6
#define _SMT1TMRU_SMT1TMR22_POSITION                        0x6
#define _SMT1TMRU_SMT1TMR22_SIZE                            0x1
#define _SMT1TMRU_SMT1TMR22_LENGTH                          0x1
#define _SMT1TMRU_SMT1TMR22_MASK                            0x40
#define _SMT1TMRU_SMT1TMR23_POSN                            0x7
#define _SMT1TMRU_SMT1TMR23_POSITION                        0x7
#define _SMT1TMRU_SMT1TMR23_SIZE                            0x1
#define _SMT1TMRU_SMT1TMR23_LENGTH                          0x1
#define _SMT1TMRU_SMT1TMR23_MASK                            0x80

