GopalSaraf/Practicals/PSDL/include/proc/pic18lf27k42.h
#define                                 RB7PPS4_bit         _BIT_ACCESS(RB7PPS,4)
// RB7PPS<RB7PPS5>
extern volatile __bit                   RB7PPS5             __at(0x1D07D);	// @ (0x3A0F * 8 + 5)
#define                                 RB7PPS5_bit         _BIT_ACCESS(RB7PPS,5)
// PORTC<RC0>
extern volatile __bit                   RC0                 __at(0x1FE60);	// @ (0x3FCC * 8 + 0)
#define                                 RC0_bit             _BIT_ACCESS(PORTC,0)
// RC0PPS<RC0PPS0>
extern volatile __bit                   RC0PPS0             __at(0x1D080);	// @ (0x3A10 * 8 + 0)
#define                                 RC0PPS0_bit         _BIT_ACCESS(RC0PPS,0)
// RC0PPS<RC0PPS1>
extern volatile __bit                   RC0PPS1             __at(0x1D081);	// @ (0x3A10 * 8 + 1)
#define                                 RC0PPS1_bit         _BIT_ACCESS(RC0PPS,1)
// RC0PPS<RC0PPS2>
extern volatile __bit                   RC0PPS2             __at(0x1D082);	// @ (0x3A10 * 8 + 2)
#define                                 RC0PPS2_bit         _BIT_ACCESS(RC0PPS,2)
// RC0PPS<RC0PPS3>
extern volatile __bit                   RC0PPS3             __at(0x1D083);	// @ (0x3A10 * 8 + 3)
#define                                 RC0PPS3_bit         _BIT_ACCESS(RC0PPS,3)
// RC0PPS<RC0PPS4>
extern volatile __bit                   RC0PPS4             __at(0x1D084);	// @ (0x3A10 * 8 + 4)
#define                                 RC0PPS4_bit         _BIT_ACCESS(RC0PPS,4)
// RC0PPS<RC0PPS5>
extern volatile __bit                   RC0PPS5             __at(0x1D085);	// @ (0x3A10 * 8 + 5)
#define                                 RC0PPS5_bit         _BIT_ACCESS(RC0PPS,5)
// PORTC<RC1>
extern volatile __bit                   RC1                 __at(0x1FE61);	// @ (0x3FCC * 8 + 1)
#define                                 RC1_bit             _BIT_ACCESS(PORTC,1)
// RC1PPS<RC1PPS0>
extern volatile __bit                   RC1PPS0             __at(0x1D088);	// @ (0x3A11 * 8 + 0)
#define                                 RC1PPS0_bit         _BIT_ACCESS(RC1PPS,0)
// RC1PPS<RC1PPS1>
extern volatile __bit                   RC1PPS1             __at(0x1D089);	// @ (0x3A11 * 8 + 1)
#define                                 RC1PPS1_bit         _BIT_ACCESS(RC1PPS,1)
// RC1PPS<RC1PPS2>
extern volatile __bit                   RC1PPS2             __at(0x1D08A);	// @ (0x3A11 * 8 + 2)
#define                                 RC1PPS2_bit         _BIT_ACCESS(RC1PPS,2)
// RC1PPS<RC1PPS3>
extern volatile __bit                   RC1PPS3             __at(0x1D08B);	// @ (0x3A11 * 8 + 3)
#define                                 RC1PPS3_bit         _BIT_ACCESS(RC1PPS,3)
// RC1PPS<RC1PPS4>
extern volatile __bit                   RC1PPS4             __at(0x1D08C);	// @ (0x3A11 * 8 + 4)
#define                                 RC1PPS4_bit         _BIT_ACCESS(RC1PPS,4)
// RC1PPS<RC1PPS5>
extern volatile __bit                   RC1PPS5             __at(0x1D08D);	// @ (0x3A11 * 8 + 5)
#define                                 RC1PPS5_bit         _BIT_ACCESS(RC1PPS,5)
// PORTC<RC2>
extern volatile __bit                   RC2                 __at(0x1FE62);	// @ (0x3FCC * 8 + 2)
#define                                 RC2_bit             _BIT_ACCESS(PORTC,2)
// RC2PPS<RC2PPS0>
extern volatile __bit                   RC2PPS0             __at(0x1D090);	// @ (0x3A12 * 8 + 0)
#define                                 RC2PPS0_bit         _BIT_ACCESS(RC2PPS,0)
// RC2PPS<RC2PPS1>
extern volatile __bit                   RC2PPS1             __at(0x1D091);	// @ (0x3A12 * 8 + 1)
#define                                 RC2PPS1_bit         _BIT_ACCESS(RC2PPS,1)
// RC2PPS<RC2PPS2>
extern volatile __bit                   RC2PPS2             __at(0x1D092);	// @ (0x3A12 * 8 + 2)
#define                                 RC2PPS2_bit         _BIT_ACCESS(RC2PPS,2)
// RC2PPS<RC2PPS3>
extern volatile __bit                   RC2PPS3             __at(0x1D093);	// @ (0x3A12 * 8 + 3)
#define                                 RC2PPS3_bit         _BIT_ACCESS(RC2PPS,3)
// RC2PPS<RC2PPS4>
extern volatile __bit                   RC2PPS4             __at(0x1D094);	// @ (0x3A12 * 8 + 4)
#define                                 RC2PPS4_bit         _BIT_ACCESS(RC2PPS,4)
// RC2PPS<RC2PPS5>
extern volatile __bit                   RC2PPS5             __at(0x1D095);	// @ (0x3A12 * 8 + 5)
#define                                 RC2PPS5_bit         _BIT_ACCESS(RC2PPS,5)
// PORTC<RC3>
extern volatile __bit                   RC3                 __at(0x1FE63);	// @ (0x3FCC * 8 + 3)
#define                                 RC3_bit             _BIT_ACCESS(PORTC,3)
// RC3PPS<RC3PPS0>
extern volatile __bit                   RC3PPS0             __at(0x1D098);	// @ (0x3A13 * 8 + 0)
#define                                 RC3PPS0_bit         _BIT_ACCESS(RC3PPS,0)
// RC3PPS<RC3PPS1>
extern volatile __bit                   RC3PPS1             __at(0x1D099);	// @ (0x3A13 * 8 + 1)
#define                                 RC3PPS1_bit         _BIT_ACCESS(RC3PPS,1)
// RC3PPS<RC3PPS2>
extern volatile __bit                   RC3PPS2             __at(0x1D09A);	// @ (0x3A13 * 8 + 2)
#define                                 RC3PPS2_bit         _BIT_ACCESS(RC3PPS,2)
// RC3PPS<RC3PPS3>
extern volatile __bit                   RC3PPS3             __at(0x1D09B);	// @ (0x3A13 * 8 + 3)
#define                                 RC3PPS3_bit         _BIT_ACCESS(RC3PPS,3)
// RC3PPS<RC3PPS4>
extern volatile __bit                   RC3PPS4             __at(0x1D09C);	// @ (0x3A13 * 8 + 4)
#define                                 RC3PPS4_bit         _BIT_ACCESS(RC3PPS,4)
// RC3PPS<RC3PPS5>
extern volatile __bit                   RC3PPS5             __at(0x1D09D);	// @ (0x3A13 * 8 + 5)
#define                                 RC3PPS5_bit         _BIT_ACCESS(RC3PPS,5)
// PORTC<RC4>
extern volatile __bit                   RC4                 __at(0x1FE64);	// @ (0x3FCC * 8 + 4)
#define                                 RC4_bit             _BIT_ACCESS(PORTC,4)
// RC4PPS<RC4PPS0>
extern volatile __bit                   RC4PPS0             __at(0x1D0A0);	// @ (0x3A14 * 8 + 0)
#define                                 RC4PPS0_bit         _BIT_ACCESS(RC4PPS,0)
// RC4PPS<RC4PPS1>
extern volatile __bit                   RC4PPS1             __at(0x1D0A1);	// @ (0x3A14 * 8 + 1)
#define                                 RC4PPS1_bit         _BIT_ACCESS(RC4PPS,1)
// RC4PPS<RC4PPS2>
extern volatile __bit                   RC4PPS2             __at(0x1D0A2);	// @ (0x3A14 * 8 + 2)
#define                                 RC4PPS2_bit         _BIT_ACCESS(RC4PPS,2)
// RC4PPS<RC4PPS3>
extern volatile __bit                   RC4PPS3             __at(0x1D0A3);	// @ (0x3A14 * 8 + 3)
#define                                 RC4PPS3_bit         _BIT_ACCESS(RC4PPS,3)
// RC4PPS<RC4PPS4>
extern volatile __bit                   RC4PPS4             __at(0x1D0A4);	// @ (0x3A14 * 8 + 4)
#define                                 RC4PPS4_bit         _BIT_ACCESS(RC4PPS,4)
// RC4PPS<RC4PPS5>
extern volatile __bit                   RC4PPS5             __at(0x1D0A5);	// @ (0x3A14 * 8 + 5)
#define                                 RC4PPS5_bit         _BIT_ACCESS(RC4PPS,5)
// PORTC<RC5>
extern volatile __bit                   RC5                 __at(0x1FE65);	// @ (0x3FCC * 8 + 5)
#define                                 RC5_bit             _BIT_ACCESS(PORTC,5)
// RC5PPS<RC5PPS0>
extern volatile __bit                   RC5PPS0             __at(0x1D0A8);	// @ (0x3A15 * 8 + 0)
#define                                 RC5PPS0_bit         _BIT_ACCESS(RC5PPS,0)
// RC5PPS<RC5PPS1>
extern volatile __bit                   RC5PPS1             __at(0x1D0A9);	// @ (0x3A15 * 8 + 1)
#define                                 RC5PPS1_bit         _BIT_ACCESS(RC5PPS,1)
// RC5PPS<RC5PPS2>
extern volatile __bit                   RC5PPS2             __at(0x1D0AA);	// @ (0x3A15 * 8 + 2)
#define                                 RC5PPS2_bit         _BIT_ACCESS(RC5PPS,2)
// RC5PPS<RC5PPS3>
extern volatile __bit                   RC5PPS3             __at(0x1D0AB);	// @ (0x3A15 * 8 + 3)
#define                                 RC5PPS3_bit         _BIT_ACCESS(RC5PPS,3)
// RC5PPS<RC5PPS4>
extern volatile __bit                   RC5PPS4             __at(0x1D0AC);	// @ (0x3A15 * 8 + 4)
#define                                 RC5PPS4_bit         _BIT_ACCESS(RC5PPS,4)
// RC5PPS<RC5PPS5>
extern volatile __bit                   RC5PPS5             __at(0x1D0AD);	// @ (0x3A15 * 8 + 5)
#define                                 RC5PPS5_bit         _BIT_ACCESS(RC5PPS,5)
// PORTC<RC6>
extern volatile __bit                   RC6                 __at(0x1FE66);	// @ (0x3FCC * 8 + 6)
#define                                 RC6_bit             _BIT_ACCESS(PORTC,6)
// RC6PPS<RC6PPS0>
extern volatile __bit                   RC6PPS0             __at(0x1D0B0);	// @ (0x3A16 * 8 + 0)
#define                                 RC6PPS0_bit         _BIT_ACCESS(RC6PPS,0)
// RC6PPS<RC6PPS1>
extern volatile __bit                   RC6PPS1             __at(0x1D0B1);	// @ (0x3A16 * 8 + 1)
#define                                 RC6PPS1_bit         _BIT_ACCESS(RC6PPS,1)
// RC6PPS<RC6PPS2>
extern volatile __bit                   RC6PPS2             __at(0x1D0B2);	// @ (0x3A16 * 8 + 2)
#define                                 RC6PPS2_bit         _BIT_ACCESS(RC6PPS,2)
// RC6PPS<RC6PPS3>
extern volatile __bit                   RC6PPS3             __at(0x1D0B3);	// @ (0x3A16 * 8 + 3)
#define                                 RC6PPS3_bit         _BIT_ACCESS(RC6PPS,3)
// RC6PPS<RC6PPS4>
extern volatile __bit                   RC6PPS4             __at(0x1D0B4);	// @ (0x3A16 * 8 + 4)
#define                                 RC6PPS4_bit         _BIT_ACCESS(RC6PPS,4)
// RC6PPS<RC6PPS5>
extern volatile __bit                   RC6PPS5             __at(0x1D0B5);	// @ (0x3A16 * 8 + 5)
#define                                 RC6PPS5_bit         _BIT_ACCESS(RC6PPS,5)
// PORTC<RC7>
extern volatile __bit                   RC7                 __at(0x1FE67);	// @ (0x3FCC * 8 + 7)
#define                                 RC7_bit             _BIT_ACCESS(PORTC,7)
// RC7PPS<RC7PPS0>
extern volatile __bit                   RC7PPS0             __at(0x1D0B8);	// @ (0x3A17 * 8 + 0)
#define                                 RC7PPS0_bit         _BIT_ACCESS(RC7PPS,0)
// RC7PPS<RC7PPS1>
extern volatile __bit                   RC7PPS1             __at(0x1D0B9);	// @ (0x3A17 * 8 + 1)
#define                                 RC7PPS1_bit         _BIT_ACCESS(RC7PPS,1)
// RC7PPS<RC7PPS2>
extern volatile __bit                   RC7PPS2             __at(0x1D0BA);	// @ (0x3A17 * 8 + 2)
#define                                 RC7PPS2_bit         _BIT_ACCESS(RC7PPS,2)
// RC7PPS<RC7PPS3>
extern volatile __bit                   RC7PPS3             __at(0x1D0BB);	// @ (0x3A17 * 8 + 3)
#define                                 RC7PPS3_bit         _BIT_ACCESS(RC7PPS,3)
// RC7PPS<RC7PPS4>
extern volatile __bit                   RC7PPS4             __at(0x1D0BC);	// @ (0x3A17 * 8 + 4)
#define                                 RC7PPS4_bit         _BIT_ACCESS(RC7PPS,4)
// RC7PPS<RC7PPS5>
extern volatile __bit                   RC7PPS5             __at(0x1D0BD);	// @ (0x3A17 * 8 + 5)
#define                                 RC7PPS5_bit         _BIT_ACCESS(RC7PPS,5)
// NVMCON1<RD>
extern volatile __bit                   RD                  __at(0x1CF28);	// @ (0x39E5 * 8 + 0)
#define                                 RD_bit              _BIT_ACCESS(NVMCON1,0)
// T1CON<RD161>
extern volatile __bit                   RD161               __at(0x1FD91);	// @ (0x3FB2 * 8 + 1)
#define                                 RD161_bit           _BIT_ACCESS(T1CON,1)
// T3CON<RD163>
extern volatile __bit                   RD163               __at(0x1FD31);	// @ (0x3FA6 * 8 + 1)
#define                                 RD163_bit           _BIT_ACCESS(T3CON,1)
// T5CON<RD165>
extern volatile __bit                   RD165               __at(0x1FCD1);	// @ (0x3F9A * 8 + 1)
#define                                 RD165_bit           _BIT_ACCESS(T5CON,1)
// PORTE<RE3>
extern volatile __bit                   RE3                 __at(0x1FE73);	// @ (0x3FCE * 8 + 3)
#define                                 RE3_bit             _BIT_ACCESS(PORTE,3)
// NVMCON1<REG0>
extern volatile __bit                   REG0                __at(0x1CF2E);	// @ (0x39E5 * 8 + 6)
#define                                 REG0_bit            _BIT_ACCESS(NVMCON1,6)
// NVMCON1<REG1>
extern volatile __bit                   REG1                __at(0x1CF2F);	// @ (0x39E5 * 8 + 7)
#define                                 REG1_bit            _BIT_ACCESS(NVMCON1,7)
// SMT1CON1<REPEAT>
extern volatile __bit                   REPEAT              __at(0x1F8FE);	// @ (0x3F1F * 8 + 6)
#define                                 REPEAT_bit          _BIT_ACCESS(SMT1CON1,6)
// ADRESL<RES0>
extern volatile __bit                   RES0                __at(0x1F778);	// @ (0x3EEF * 8 + 0)
#define                                 RES0_bit            _BIT_ACCESS(ADRESL,0)
// ADRESL<RES1>
extern volatile __bit                   RES1                __at(0x1F779);	// @ (0x3EEF * 8 + 1)
#define                                 RES1_bit            _BIT_ACCESS(ADRESL,1)
// ADRESH<RES10>
extern volatile __bit                   RES10               __at(0x1F782);	// @ (0x3EF0 * 8 + 2)
#define                                 RES10_bit           _BIT_ACCESS(ADRESH,2)
// ADRESH<RES11>
extern volatile __bit                   RES11               __at(0x1F783);	// @ (0x3EF0 * 8 + 3)
#define                                 RES11_bit           _BIT_ACCESS(ADRESH,3)
// ADRESH<RES12>
extern volatile __bit                   RES12               __at(0x1F784);	// @ (0x3EF0 * 8 + 4)
#define                                 RES12_bit           _BIT_ACCESS(ADRESH,4)
// ADRESH<RES13>
extern volatile __bit                   RES13               __at(0x1F785);	// @ (0x3EF0 * 8 + 5)
#define                                 RES13_bit           _BIT_ACCESS(ADRESH,5)
// ADRESH<RES14>
extern volatile __bit                   RES14               __at(0x1F786);	// @ (0x3EF0 * 8 + 6)
#define                                 RES14_bit           _BIT_ACCESS(ADRESH,6)
// ADRESH<RES15>
extern volatile __bit                   RES15               __at(0x1F787);	// @ (0x3EF0 * 8 + 7)
#define                                 RES15_bit           _BIT_ACCESS(ADRESH,7)
// ADRESL<RES2>
extern volatile __bit                   RES2                __at(0x1F77A);	// @ (0x3EEF * 8 + 2)
#define                                 RES2_bit            _BIT_ACCESS(ADRESL,2)
// ADRESL<RES3>
extern volatile __bit                   RES3                __at(0x1F77B);	// @ (0x3EEF * 8 + 3)
#define                                 RES3_bit            _BIT_ACCESS(ADRESL,3)
// ADRESL<RES4>
extern volatile __bit                   RES4                __at(0x1F77C);	// @ (0x3EEF * 8 + 4)
#define                                 RES4_bit            _BIT_ACCESS(ADRESL,4)
// ADRESL<RES5>
extern volatile __bit                   RES5                __at(0x1F77D);	// @ (0x3EEF * 8 + 5)
#define                                 RES5_bit            _BIT_ACCESS(ADRESL,5)
// ADRESL<RES6>
extern volatile __bit                   RES6                __at(0x1F77E);	// @ (0x3EEF * 8 + 6)
#define                                 RES6_bit            _BIT_ACCESS(ADRESL,6)
// ADRESL<RES7>
extern volatile __bit                   RES7                __at(0x1F77F);	// @ (0x3EEF * 8 + 7)
#define                                 RES7_bit            _BIT_ACCESS(ADRESL,7)
// ADRESH<RES8>
extern volatile __bit                   RES8                __at(0x1F780);	// @ (0x3EF0 * 8 + 0)
#define                                 RES8_bit            _BIT_ACCESS(ADRESH,0)
// ADRESH<RES9>
extern volatile __bit                   RES9                __at(0x1F781);	// @ (0x3EF0 * 8 + 1)
#define                                 RES9_bit            _BIT_ACCESS(ADRESH,1)
// PCON0<RI>
extern volatile __bit                   RI                  __at(0x1FF82);	// @ (0x3FF0 * 8 + 2)
#define                                 RI_bit              _BIT_ACCESS(PCON0,2)
// PCON0<RMCLR>
extern volatile __bit                   RMCLR               __at(0x1FF83);	// @ (0x3FF0 * 8 + 3)
#define                                 RMCLR_bit           _BIT_ACCESS(PCON0,3)
// CPUDOZE<ROI>
extern volatile __bit                   ROI                 __at(0x1CEC5);	// @ (0x39D8 * 8 + 5)
#define                                 ROI_bit             _BIT_ACCESS(CPUDOZE,5)
// ADRPT<RPT0>
extern volatile __bit                   RPT0                __at(0x1F760);	// @ (0x3EEC * 8 + 0)
#define                                 RPT0_bit            _BIT_ACCESS(ADRPT,0)
// ADRPT<RPT1>
extern volatile __bit                   RPT1                __at(0x1F761);	// @ (0x3EEC * 8 + 1)
#define                                 RPT1_bit            _BIT_ACCESS(ADRPT,1)
// ADRPT<RPT2>
extern volatile __bit                   RPT2                __at(0x1F762);	// @ (0x3EEC * 8 + 2)
#define                                 RPT2_bit            _BIT_ACCESS(ADRPT,2)
// ADRPT<RPT3>
extern volatile __bit                   RPT3                __at(0x1F763);	// @ (0x3EEC * 8 + 3)
#define                                 RPT3_bit            _BIT_ACCESS(ADRPT,3)
// ADRPT<RPT4>
extern volatile __bit                   RPT4                __at(0x1F764);	// @ (0x3EEC * 8 + 4)
#define                                 RPT4_bit            _BIT_ACCESS(ADRPT,4)
// ADRPT<RPT5>
extern volatile __bit                   RPT5                __at(0x1F765);	// @ (0x3EEC * 8 + 5)
#define                                 RPT5_bit            _BIT_ACCESS(ADRPT,5)
// ADRPT<RPT6>
extern volatile __bit                   RPT6                __at(0x1F766);	// @ (0x3EEC * 8 + 6)
#define                                 RPT6_bit            _BIT_ACCESS(ADRPT,6)
// ADRPT<RPT7>
extern volatile __bit                   RPT7                __at(0x1F767);	// @ (0x3EEC * 8 + 7)
#define                                 RPT7_bit            _BIT_ACCESS(ADRPT,7)
// I2C1PIE<RSC1IE>
extern volatile __bit                   RSC1IE              __at(0x1EBD1);	// @ (0x3D7A * 8 + 1)
#define                                 RSC1IE_bit          _BIT_ACCESS(I2C1PIE,1)
// I2C1PIR<RSC1IF>
extern volatile __bit                   RSC1IF              __at(0x1EBC9);	// @ (0x3D79 * 8 + 1)
#define                                 RSC1IF_bit          _BIT_ACCESS(I2C1PIR,1)
// I2C2PIE<RSC2IE>
extern volatile __bit                   RSC2IE              __at(0x1EB21);	// @ (0x3D64 * 8 + 1)
#define                                 RSC2IE_bit          _BIT_ACCESS(I2C2PIE,1)
// I2C2PIR<RSC2IF>
extern volatile __bit                   RSC2IF              __at(0x1EB19);	// @ (0x3D63 * 8 + 1)
#define                                 RSC2IF_bit          _BIT_ACCESS(I2C2PIR,1)
// SMT1STAT<RST>
extern volatile __bit                   RST                 __at(0x1F905);	// @ (0x3F20 * 8 + 5)
#define                                 RST_bit             _BIT_ACCESS(SMT1STAT,5)
// PCON0<RWDT>
extern volatile __bit                   RWDT                __at(0x1FF84);	// @ (0x3FF0 * 8 + 4)
#define                                 RWDT_bit            _BIT_ACCESS(PCON0,4)
// SPI1RXB<RXB0>
extern volatile __bit                   RXB0                __at(0x1E880);	// @ (0x3D10 * 8 + 0)
#define                                 RXB0_bit            _BIT_ACCESS(SPI1RXB,0)
// SPI1RXB<RXB1>
extern volatile __bit                   RXB1                __at(0x1E881);	// @ (0x3D10 * 8 + 1)
#define                                 RXB1_bit            _BIT_ACCESS(SPI1RXB,1)
// SPI1RXB<RXB2>
extern volatile __bit                   RXB2                __at(0x1E882);	// @ (0x3D10 * 8 + 2)
#define                                 RXB2_bit            _BIT_ACCESS(SPI1RXB,2)
// SPI1RXB<RXB3>
extern volatile __bit                   RXB3                __at(0x1E883);	// @ (0x3D10 * 8 + 3)
#define                                 RXB3_bit            _BIT_ACCESS(SPI1RXB,3)
// SPI1RXB<RXB4>
extern volatile __bit                   RXB4                __at(0x1E884);	// @ (0x3D10 * 8 + 4)
#define                                 RXB4_bit            _BIT_ACCESS(SPI1RXB,4)
// SPI1RXB<RXB5>
extern volatile __bit                   RXB5                __at(0x1E885);	// @ (0x3D10 * 8 + 5)
#define                                 RXB5_bit            _BIT_ACCESS(SPI1RXB,5)
// SPI1RXB<RXB6>
extern volatile __bit                   RXB6                __at(0x1E886);	// @ (0x3D10 * 8 + 6)
#define                                 RXB6_bit            _BIT_ACCESS(SPI1RXB,6)
// SPI1RXB<RXB7>
extern volatile __bit                   RXB7                __at(0x1E887);	// @ (0x3D10 * 8 + 7)
#define                                 RXB7_bit            _BIT_ACCESS(SPI1RXB,7)
// SPI1INTE<RXOIE>
extern volatile __bit                   RXOIE               __at(0x1E8DA);	// @ (0x3D1B * 8 + 2)
#define                                 RXOIE_bit           _BIT_ACCESS(SPI1INTE,2)
// SPI1INTF<RXOIF>
extern volatile __bit                   RXOIF               __at(0x1E8D2);	// @ (0x3D1A * 8 + 2)
#define                                 RXOIF_bit           _BIT_ACCESS(SPI1INTF,2)
// SPI1CON2<RXR>
extern volatile __bit                   RXR                 __at(0x1E8B0);	// @ (0x3D16 * 8 + 0)
#define                                 RXR_bit             _BIT_ACCESS(SPI1CON2,0)
// BORCON<SBOREN>
extern volatile __bit                   SBOREN              __at(0x1CE87);	// @ (0x39D0 * 8 + 7)
#define                                 SBOREN_bit          _BIT_ACCESS(BORCON,7)
// I2C1PIE<SC1IE>
extern volatile __bit                   SC1IE               __at(0x1EBD0);	// @ (0x3D7A * 8 + 0)
#define                                 SC1IE_bit           _BIT_ACCESS(I2C1PIE,0)
// I2C1PIR<SC1IF>
extern volatile __bit                   SC1IF               __at(0x1EBC8);	// @ (0x3D79 * 8 + 0)
#define                                 SC1IF_bit           _BIT_ACCESS(I2C1PIR,0)
// I2C2PIE<SC2IE>
extern volatile __bit                   SC2IE               __at(0x1EB20);	// @ (0x3D64 * 8 + 0)
#define                                 SC2IE_bit           _BIT_ACCESS(I2C2PIE,0)
// I2C2PIR<SC2IF>
extern volatile __bit                   SC2IF               __at(0x1EB18);	// @ (0x3D63 * 8 + 0)
#define                                 SC2IF_bit           _BIT_ACCESS(I2C2PIR,0)
// SCANHADRL<SCANHADR0>
extern volatile __bit                   SCANHADR0           __at(0x1CBC8);	// @ (0x3979 * 8 + 0)
#define                                 SCANHADR0_bit       _BIT_ACCESS(SCANHADRL,0)
// SCANHADRL<SCANHADR1>
extern volatile __bit                   SCANHADR1           __at(0x1CBC9);	// @ (0x3979 * 8 + 1)
#define                                 SCANHADR1_bit       _BIT_ACCESS(SCANHADRL,1)
// SCANHADRH<SCANHADR10>
extern volatile __bit                   SCANHADR10          __at(0x1CBD2);	// @ (0x397A * 8 + 2)
#define                                 SCANHADR10_bit      _BIT_ACCESS(SCANHADRH,2)
// SCANHADRH<SCANHADR11>
extern volatile __bit                   SCANHADR11          __at(0x1CBD3);	// @ (0x397A * 8 + 3)
#define                                 SCANHADR11_bit      _BIT_ACCESS(SCANHADRH,3)
// SCANHADRH<SCANHADR12>
extern volatile __bit                   SCANHADR12          __at(0x1CBD4);	// @ (0x397A * 8 + 4)
#define                                 SCANHADR12_bit      _BIT_ACCESS(SCANHADRH,4)
// SCANHADRH<SCANHADR13>
extern volatile __bit                   SCANHADR13          __at(0x1CBD5);	// @ (0x397A * 8 + 5)
#define                                 SCANHADR13_bit      _BIT_ACCESS(SCANHADRH,5)
// SCANHADRH<SCANHADR14>
extern volatile __bit                   SCANHADR14          __at(0x1CBD6);	// @ (0x397A * 8 + 6)
#define                                 SCANHADR14_bit      _BIT_ACCESS(SCANHADRH,6)
// SCANHADRH<SCANHADR15>
