GopalSaraf/Practicals/PSDL/include/proc/pic18lf27k42.h
#define                                 SP2_bit             _BIT_ACCESS(STKPTR,2)
// STKPTR<SP3>
extern volatile __bit                   SP3                 __at(0x1FFE3);	// @ (0x3FFC * 8 + 3)
#define                                 SP3_bit             _BIT_ACCESS(STKPTR,3)
// STKPTR<SP4>
extern volatile __bit                   SP4                 __at(0x1FFE4);	// @ (0x3FFC * 8 + 4)
#define                                 SP4_bit             _BIT_ACCESS(STKPTR,4)
// SPI1CON0<SPI1BMODE>
extern volatile __bit                   SPI1BMODE           __at(0x1E8A0);	// @ (0x3D14 * 8 + 0)
#define                                 SPI1BMODE_bit       _BIT_ACCESS(SPI1CON0,0)
// SPI1CON2<SPI1BUSY>
extern volatile __bit                   SPI1BUSY            __at(0x1E8B7);	// @ (0x3D16 * 8 + 7)
#define                                 SPI1BUSY_bit        _BIT_ACCESS(SPI1CON2,7)
// SPI1CON1<SPI1CKE>
extern volatile __bit                   SPI1CKE             __at(0x1E8AE);	// @ (0x3D15 * 8 + 6)
#define                                 SPI1CKE_bit         _BIT_ACCESS(SPI1CON1,6)
// SPI1CON1<SPI1CKP>
extern volatile __bit                   SPI1CKP             __at(0x1E8AD);	// @ (0x3D15 * 8 + 5)
#define                                 SPI1CKP_bit         _BIT_ACCESS(SPI1CON1,5)
// SPI1CLK<SPI1CLKSEL0>
extern volatile __bit                   SPI1CLKSEL0         __at(0x1E8E0);	// @ (0x3D1C * 8 + 0)
#define                                 SPI1CLKSEL0_bit     _BIT_ACCESS(SPI1CLK,0)
// SPI1CLK<SPI1CLKSEL1>
extern volatile __bit                   SPI1CLKSEL1         __at(0x1E8E1);	// @ (0x3D1C * 8 + 1)
#define                                 SPI1CLKSEL1_bit     _BIT_ACCESS(SPI1CLK,1)
// SPI1CLK<SPI1CLKSEL2>
extern volatile __bit                   SPI1CLKSEL2         __at(0x1E8E2);	// @ (0x3D1C * 8 + 2)
#define                                 SPI1CLKSEL2_bit     _BIT_ACCESS(SPI1CLK,2)
// SPI1CLK<SPI1CLKSEL3>
extern volatile __bit                   SPI1CLKSEL3         __at(0x1E8E3);	// @ (0x3D1C * 8 + 3)
#define                                 SPI1CLKSEL3_bit     _BIT_ACCESS(SPI1CLK,3)
// SPI1STATUS<SPI1CLRBF>
extern volatile __bit                   SPI1CLRBF           __at(0x1E8BA);	// @ (0x3D17 * 8 + 2)
#define                                 SPI1CLRBF_bit       _BIT_ACCESS(SPI1STATUS,2)
// SPI1INTE<SPI1EOSIE>
extern volatile __bit                   SPI1EOSIE           __at(0x1E8DC);	// @ (0x3D1B * 8 + 4)
#define                                 SPI1EOSIE_bit       _BIT_ACCESS(SPI1INTE,4)
// SPI1INTF<SPI1EOSIF>
extern volatile __bit                   SPI1EOSIF           __at(0x1E8D4);	// @ (0x3D1A * 8 + 4)
#define                                 SPI1EOSIF_bit       _BIT_ACCESS(SPI1INTF,4)
// SPI1CON1<SPI1FST>
extern volatile __bit                   SPI1FST             __at(0x1E8AC);	// @ (0x3D15 * 8 + 4)
#define                                 SPI1FST_bit         _BIT_ACCESS(SPI1CON1,4)
// PIE2<SPI1IE>
extern volatile __bit                   SPI1IE              __at(0x1CC96);	// @ (0x3992 * 8 + 6)
#define                                 SPI1IE_bit          _BIT_ACCESS(PIE2,6)
// PIR2<SPI1IF>
extern volatile __bit                   SPI1IF              __at(0x1CD16);	// @ (0x39A2 * 8 + 6)
#define                                 SPI1IF_bit          _BIT_ACCESS(PIR2,6)
// IPR2<SPI1IP>
extern volatile __bit                   SPI1IP              __at(0x1CC16);	// @ (0x3982 * 8 + 6)
#define                                 SPI1IP_bit          _BIT_ACCESS(IPR2,6)
// SPI1CON0<SPI1LSBF>
extern volatile __bit                   SPI1LSBF            __at(0x1E8A2);	// @ (0x3D14 * 8 + 2)
#define                                 SPI1LSBF_bit        _BIT_ACCESS(SPI1CON0,2)
// PMD5<SPI1MD>
extern volatile __bit                   SPI1MD              __at(0x1CE2A);	// @ (0x39C5 * 8 + 2)
#define                                 SPI1MD_bit          _BIT_ACCESS(PMD5,2)
// SPI1CON0<SPI1MST>
extern volatile __bit                   SPI1MST             __at(0x1E8A1);	// @ (0x3D14 * 8 + 1)
#define                                 SPI1MST_bit         _BIT_ACCESS(SPI1CON0,1)
// SPI1STATUS<SPI1RXBF>
extern volatile __bit                   SPI1RXBF            __at(0x1E8B8);	// @ (0x3D17 * 8 + 0)
#define                                 SPI1RXBF_bit        _BIT_ACCESS(SPI1STATUS,0)
// PIE2<SPI1RXIE>
extern volatile __bit                   SPI1RXIE            __at(0x1CC94);	// @ (0x3992 * 8 + 4)
#define                                 SPI1RXIE_bit        _BIT_ACCESS(PIE2,4)
// PIR2<SPI1RXIF>
extern volatile __bit                   SPI1RXIF            __at(0x1CD14);	// @ (0x39A2 * 8 + 4)
#define                                 SPI1RXIF_bit        _BIT_ACCESS(PIR2,4)
// IPR2<SPI1RXIP>
extern volatile __bit                   SPI1RXIP            __at(0x1CC14);	// @ (0x3982 * 8 + 4)
#define                                 SPI1RXIP_bit        _BIT_ACCESS(IPR2,4)
// SPI1INTE<SPI1RXOIE>
extern volatile __bit                   SPI1RXOIE           __at(0x1E8DA);	// @ (0x3D1B * 8 + 2)
#define                                 SPI1RXOIE_bit       _BIT_ACCESS(SPI1INTE,2)
// SPI1INTF<SPI1RXOIF>
extern volatile __bit                   SPI1RXOIF           __at(0x1E8D2);	// @ (0x3D1A * 8 + 2)
#define                                 SPI1RXOIF_bit       _BIT_ACCESS(SPI1INTF,2)
// SPI1CON2<SPI1RXR>
extern volatile __bit                   SPI1RXR             __at(0x1E8B0);	// @ (0x3D16 * 8 + 0)
#define                                 SPI1RXR_bit         _BIT_ACCESS(SPI1CON2,0)
// SPI1STATUS<SPI1RXRE>
extern volatile __bit                   SPI1RXRE            __at(0x1E8BB);	// @ (0x3D17 * 8 + 3)
#define                                 SPI1RXRE_bit        _BIT_ACCESS(SPI1STATUS,3)
// SPI1CON1<SPI1SDIP>
extern volatile __bit                   SPI1SDIP            __at(0x1E8A9);	// @ (0x3D15 * 8 + 1)
#define                                 SPI1SDIP_bit        _BIT_ACCESS(SPI1CON1,1)
// SPI1CON1<SPI1SDOP>
extern volatile __bit                   SPI1SDOP            __at(0x1E8A8);	// @ (0x3D15 * 8 + 0)
#define                                 SPI1SDOP_bit        _BIT_ACCESS(SPI1CON1,0)
// SPI1CON1<SPI1SMP>
extern volatile __bit                   SPI1SMP             __at(0x1E8AF);	// @ (0x3D15 * 8 + 7)
#define                                 SPI1SMP_bit         _BIT_ACCESS(SPI1CON1,7)
// SPI1INTE<SPI1SOSIE>
extern volatile __bit                   SPI1SOSIE           __at(0x1E8DD);	// @ (0x3D1B * 8 + 5)
#define                                 SPI1SOSIE_bit       _BIT_ACCESS(SPI1INTE,5)
// SPI1INTF<SPI1SOSIF>
extern volatile __bit                   SPI1SOSIF           __at(0x1E8D5);	// @ (0x3D1A * 8 + 5)
#define                                 SPI1SOSIF_bit       _BIT_ACCESS(SPI1INTF,5)
// SPI1CON0<SPI1SPIEN>
extern volatile __bit                   SPI1SPIEN           __at(0x1E8A7);	// @ (0x3D14 * 8 + 7)
#define                                 SPI1SPIEN_bit       _BIT_ACCESS(SPI1CON0,7)
// SPI1INTE<SPI1SRMTIE>
extern volatile __bit                   SPI1SRMTIE          __at(0x1E8DF);	// @ (0x3D1B * 8 + 7)
#define                                 SPI1SRMTIE_bit      _BIT_ACCESS(SPI1INTE,7)
// SPI1INTF<SPI1SRMTIF>
extern volatile __bit                   SPI1SRMTIF          __at(0x1E8D7);	// @ (0x3D1A * 8 + 7)
#define                                 SPI1SRMTIF_bit      _BIT_ACCESS(SPI1INTF,7)
// SPI1CON2<SPI1SSET>
extern volatile __bit                   SPI1SSET            __at(0x1E8B2);	// @ (0x3D16 * 8 + 2)
#define                                 SPI1SSET_bit        _BIT_ACCESS(SPI1CON2,2)
// SPI1CON2<SPI1SSFLT>
extern volatile __bit                   SPI1SSFLT           __at(0x1E8B6);	// @ (0x3D16 * 8 + 6)
#define                                 SPI1SSFLT_bit       _BIT_ACCESS(SPI1CON2,6)
// SPI1CON1<SPI1SSP>
extern volatile __bit                   SPI1SSP             __at(0x1E8AA);	// @ (0x3D15 * 8 + 2)
#define                                 SPI1SSP_bit         _BIT_ACCESS(SPI1CON1,2)
// SPI1INTE<SPI1TCZIE>
extern volatile __bit                   SPI1TCZIE           __at(0x1E8DE);	// @ (0x3D1B * 8 + 6)
#define                                 SPI1TCZIE_bit       _BIT_ACCESS(SPI1INTE,6)
// SPI1INTF<SPI1TCZIF>
extern volatile __bit                   SPI1TCZIF           __at(0x1E8D6);	// @ (0x3D1A * 8 + 6)
#define                                 SPI1TCZIF_bit       _BIT_ACCESS(SPI1INTF,6)
// SPI1STATUS<SPI1TXBE>
extern volatile __bit                   SPI1TXBE            __at(0x1E8BD);	// @ (0x3D17 * 8 + 5)
#define                                 SPI1TXBE_bit        _BIT_ACCESS(SPI1STATUS,5)
// PIE2<SPI1TXIE>
extern volatile __bit                   SPI1TXIE            __at(0x1CC95);	// @ (0x3992 * 8 + 5)
#define                                 SPI1TXIE_bit        _BIT_ACCESS(PIE2,5)
// PIR2<SPI1TXIF>
extern volatile __bit                   SPI1TXIF            __at(0x1CD15);	// @ (0x39A2 * 8 + 5)
#define                                 SPI1TXIF_bit        _BIT_ACCESS(PIR2,5)
// IPR2<SPI1TXIP>
extern volatile __bit                   SPI1TXIP            __at(0x1CC15);	// @ (0x3982 * 8 + 5)
#define                                 SPI1TXIP_bit        _BIT_ACCESS(IPR2,5)
// SPI1CON2<SPI1TXR>
extern volatile __bit                   SPI1TXR             __at(0x1E8B1);	// @ (0x3D16 * 8 + 1)
#define                                 SPI1TXR_bit         _BIT_ACCESS(SPI1CON2,1)
// SPI1INTE<SPI1TXUIE>
extern volatile __bit                   SPI1TXUIE           __at(0x1E8D9);	// @ (0x3D1B * 8 + 1)
#define                                 SPI1TXUIE_bit       _BIT_ACCESS(SPI1INTE,1)
// SPI1INTF<SPI1TXUIF>
extern volatile __bit                   SPI1TXUIF           __at(0x1E8D1);	// @ (0x3D1A * 8 + 1)
#define                                 SPI1TXUIF_bit       _BIT_ACCESS(SPI1INTF,1)
// SPI1STATUS<SPI1TXWE>
extern volatile __bit                   SPI1TXWE            __at(0x1E8BF);	// @ (0x3D17 * 8 + 7)
#define                                 SPI1TXWE_bit        _BIT_ACCESS(SPI1STATUS,7)
// SMT1CON0<SPOL>
extern volatile __bit                   SPOL                __at(0x1F8F3);	// @ (0x3F1E * 8 + 3)
#define                                 SPOL_bit            _BIT_ACCESS(SMT1CON0,3)
// SPI1INTE<SRMTIE>
extern volatile __bit                   SRMTIE              __at(0x1E8DF);	// @ (0x3D1B * 8 + 7)
#define                                 SRMTIE_bit          _BIT_ACCESS(SPI1INTE,7)
// SPI1INTF<SRMTIF>
extern volatile __bit                   SRMTIF              __at(0x1E8D7);	// @ (0x3D1A * 8 + 7)
#define                                 SRMTIF_bit          _BIT_ACCESS(SPI1INTF,7)
// SMT1SIG<SSEL0>
extern volatile __bit                   SSEL0               __at(0x1F910);	// @ (0x3F22 * 8 + 0)
#define                                 SSEL0_bit           _BIT_ACCESS(SMT1SIG,0)
// SMT1SIG<SSEL1>
extern volatile __bit                   SSEL1               __at(0x1F911);	// @ (0x3F22 * 8 + 1)
#define                                 SSEL1_bit           _BIT_ACCESS(SMT1SIG,1)
// SMT1SIG<SSEL2>
extern volatile __bit                   SSEL2               __at(0x1F912);	// @ (0x3F22 * 8 + 2)
#define                                 SSEL2_bit           _BIT_ACCESS(SMT1SIG,2)
// SMT1SIG<SSEL3>
extern volatile __bit                   SSEL3               __at(0x1F913);	// @ (0x3F22 * 8 + 3)
#define                                 SSEL3_bit           _BIT_ACCESS(SMT1SIG,3)
// SMT1SIG<SSEL4>
extern volatile __bit                   SSEL4               __at(0x1F914);	// @ (0x3F22 * 8 + 4)
#define                                 SSEL4_bit           _BIT_ACCESS(SMT1SIG,4)
// SPI1CON2<SSET>
extern volatile __bit                   SSET                __at(0x1E8B2);	// @ (0x3D16 * 8 + 2)
#define                                 SSET_bit            _BIT_ACCESS(SPI1CON2,2)
// SPI1CON2<SSFLT>
extern volatile __bit                   SSFLT               __at(0x1E8B6);	// @ (0x3D16 * 8 + 6)
#define                                 SSFLT_bit           _BIT_ACCESS(SPI1CON2,6)
// SPI1CON1<SSP>
extern volatile __bit                   SSP                 __at(0x1E8AA);	// @ (0x3D15 * 8 + 2)
#define                                 SSP_bit             _BIT_ACCESS(SPI1CON1,2)
// ADSTAT<STAT2>
extern volatile __bit                   STAT2               __at(0x1F7E2);	// @ (0x3EFC * 8 + 2)
#define                                 STAT2_bit           _BIT_ACCESS(ADSTAT,2)
// WDTTMR<STATE>
extern volatile __bit                   STATE               __at(0x1CAFA);	// @ (0x395F * 8 + 2)
#define                                 STATE_bit           _BIT_ACCESS(WDTTMR,2)
// PCON0<STKOVF>
extern volatile __bit                   STKOVF              __at(0x1FF87);	// @ (0x3FF0 * 8 + 7)
#define                                 STKOVF_bit          _BIT_ACCESS(PCON0,7)
// STKPTR<STKPTR0>
extern volatile __bit                   STKPTR0             __at(0x1FFE0);	// @ (0x3FFC * 8 + 0)
#define                                 STKPTR0_bit         _BIT_ACCESS(STKPTR,0)
// STKPTR<STKPTR1>
extern volatile __bit                   STKPTR1             __at(0x1FFE1);	// @ (0x3FFC * 8 + 1)
#define                                 STKPTR1_bit         _BIT_ACCESS(STKPTR,1)
// STKPTR<STKPTR2>
extern volatile __bit                   STKPTR2             __at(0x1FFE2);	// @ (0x3FFC * 8 + 2)
#define                                 STKPTR2_bit         _BIT_ACCESS(STKPTR,2)
// STKPTR<STKPTR3>
extern volatile __bit                   STKPTR3             __at(0x1FFE3);	// @ (0x3FFC * 8 + 3)
#define                                 STKPTR3_bit         _BIT_ACCESS(STKPTR,3)
// STKPTR<STKPTR4>
extern volatile __bit                   STKPTR4             __at(0x1FFE4);	// @ (0x3FFC * 8 + 4)
#define                                 STKPTR4_bit         _BIT_ACCESS(STKPTR,4)
// PCON0<STKUNF>
extern volatile __bit                   STKUNF              __at(0x1FF86);	// @ (0x3FF0 * 8 + 6)
#define                                 STKUNF_bit          _BIT_ACCESS(PCON0,6)
// SMT1CON0<STP>
extern volatile __bit                   STP                 __at(0x1F8F5);	// @ (0x3F1E * 8 + 5)
#define                                 STP_bit             _BIT_ACCESS(SMT1CON0,5)
// ADSTPTL<STPT0>
extern volatile __bit                   STPT0               __at(0x1F720);	// @ (0x3EE4 * 8 + 0)
#define                                 STPT0_bit           _BIT_ACCESS(ADSTPTL,0)
// ADSTPTL<STPT1>
extern volatile __bit                   STPT1               __at(0x1F721);	// @ (0x3EE4 * 8 + 1)
#define                                 STPT1_bit           _BIT_ACCESS(ADSTPTL,1)
// ADSTPTH<STPT10>
extern volatile __bit                   STPT10              __at(0x1F72A);	// @ (0x3EE5 * 8 + 2)
#define                                 STPT10_bit          _BIT_ACCESS(ADSTPTH,2)
// ADSTPTH<STPT11>
extern volatile __bit                   STPT11              __at(0x1F72B);	// @ (0x3EE5 * 8 + 3)
#define                                 STPT11_bit          _BIT_ACCESS(ADSTPTH,3)
// ADSTPTH<STPT12>
extern volatile __bit                   STPT12              __at(0x1F72C);	// @ (0x3EE5 * 8 + 4)
#define                                 STPT12_bit          _BIT_ACCESS(ADSTPTH,4)
// ADSTPTH<STPT13>
extern volatile __bit                   STPT13              __at(0x1F72D);	// @ (0x3EE5 * 8 + 5)
#define                                 STPT13_bit          _BIT_ACCESS(ADSTPTH,5)
// ADSTPTH<STPT15>
extern volatile __bit                   STPT15              __at(0x1F72E);	// @ (0x3EE5 * 8 + 6)
#define                                 STPT15_bit          _BIT_ACCESS(ADSTPTH,6)
// ADSTPTH<STPT16>
extern volatile __bit                   STPT16              __at(0x1F72F);	// @ (0x3EE5 * 8 + 7)
#define                                 STPT16_bit          _BIT_ACCESS(ADSTPTH,7)
// ADSTPTL<STPT2>
extern volatile __bit                   STPT2               __at(0x1F722);	// @ (0x3EE4 * 8 + 2)
#define                                 STPT2_bit           _BIT_ACCESS(ADSTPTL,2)
// ADSTPTL<STPT3>
extern volatile __bit                   STPT3               __at(0x1F723);	// @ (0x3EE4 * 8 + 3)
#define                                 STPT3_bit           _BIT_ACCESS(ADSTPTL,3)
// ADSTPTL<STPT4>
extern volatile __bit                   STPT4               __at(0x1F724);	// @ (0x3EE4 * 8 + 4)
#define                                 STPT4_bit           _BIT_ACCESS(ADSTPTL,4)
// ADSTPTL<STPT5>
extern volatile __bit                   STPT5               __at(0x1F725);	// @ (0x3EE4 * 8 + 5)
#define                                 STPT5_bit           _BIT_ACCESS(ADSTPTL,5)
// ADSTPTL<STPT6>
extern volatile __bit                   STPT6               __at(0x1F726);	// @ (0x3EE4 * 8 + 6)
#define                                 STPT6_bit           _BIT_ACCESS(ADSTPTL,6)
// ADSTPTL<STPT7>
extern volatile __bit                   STPT7               __at(0x1F727);	// @ (0x3EE4 * 8 + 7)
#define                                 STPT7_bit           _BIT_ACCESS(ADSTPTL,7)
// ADSTPTH<STPT8>
extern volatile __bit                   STPT8               __at(0x1F728);	// @ (0x3EE5 * 8 + 0)
#define                                 STPT8_bit           _BIT_ACCESS(ADSTPTH,0)
// ADSTPTH<STPT9>
extern volatile __bit                   STPT9               __at(0x1F729);	// @ (0x3EE5 * 8 + 1)
#define                                 STPT9_bit           _BIT_ACCESS(ADSTPTH,1)
// WDTCON0<SWDTEN>
extern volatile __bit                   SWDTEN              __at(0x1CAD8);	// @ (0x395B * 8 + 0)
#define                                 SWDTEN_bit          _BIT_ACCESS(WDTCON0,0)
// PIE0<SWIE>
extern volatile __bit                   SWIE                __at(0x1CC80);	// @ (0x3990 * 8 + 0)
#define                                 SWIE_bit            _BIT_ACCESS(PIE0,0)
// PIR0<SWIF>
extern volatile __bit                   SWIF                __at(0x1CD00);	// @ (0x39A0 * 8 + 0)
#define                                 SWIF_bit            _BIT_ACCESS(PIR0,0)
// IPR0<SWIP>
extern volatile __bit                   SWIP                __at(0x1CC00);	// @ (0x3980 * 8 + 0)
#define                                 SWIP_bit            _BIT_ACCESS(IPR0,0)
// PMD0<SYSCMD>
extern volatile __bit                   SYSCMD              __at(0x1CE07);	// @ (0x39C0 * 8 + 7)
#define                                 SYSCMD_bit          _BIT_ACCESS(PMD0,7)
// T0CON0<T016BIT>
extern volatile __bit                   T016BIT             __at(0x1FDC4);	// @ (0x3FB8 * 8 + 4)
#define                                 T016BIT_bit         _BIT_ACCESS(T0CON0,4)
// T0CON1<T0ASYNC>
extern volatile __bit                   T0ASYNC             __at(0x1FDCC);	// @ (0x3FB9 * 8 + 4)
#define                                 T0ASYNC_bit         _BIT_ACCESS(T0CON1,4)
// T0CON1<T0CKPS0>
extern volatile __bit                   T0CKPS0             __at(0x1FDC8);	// @ (0x3FB9 * 8 + 0)
#define                                 T0CKPS0_bit         _BIT_ACCESS(T0CON1,0)
// T0CON1<T0CKPS1>
extern volatile __bit                   T0CKPS1             __at(0x1FDC9);	// @ (0x3FB9 * 8 + 1)
#define                                 T0CKPS1_bit         _BIT_ACCESS(T0CON1,1)
// T0CON1<T0CKPS2>
extern volatile __bit                   T0CKPS2             __at(0x1FDCA);	// @ (0x3FB9 * 8 + 2)
#define                                 T0CKPS2_bit         _BIT_ACCESS(T0CON1,2)
// T0CON1<T0CKPS3>
extern volatile __bit                   T0CKPS3             __at(0x1FDCB);	// @ (0x3FB9 * 8 + 3)
#define                                 T0CKPS3_bit         _BIT_ACCESS(T0CON1,3)
// T0CON1<T0CS0>
extern volatile __bit                   T0CS0               __at(0x1FDCD);	// @ (0x3FB9 * 8 + 5)
#define                                 T0CS0_bit           _BIT_ACCESS(T0CON1,5)
// T0CON1<T0CS1>
extern volatile __bit                   T0CS1               __at(0x1FDCE);	// @ (0x3FB9 * 8 + 6)
#define                                 T0CS1_bit           _BIT_ACCESS(T0CON1,6)
// T0CON1<T0CS2>
extern volatile __bit                   T0CS2               __at(0x1FDCF);	// @ (0x3FB9 * 8 + 7)
#define                                 T0CS2_bit           _BIT_ACCESS(T0CON1,7)
// T0CON0<T0EN>
extern volatile __bit                   T0EN                __at(0x1FDC7);	// @ (0x3FB8 * 8 + 7)
#define                                 T0EN_bit            _BIT_ACCESS(T0CON0,7)
// T0CON0<T0MD16>
extern volatile __bit                   T0MD16              __at(0x1FDC4);	// @ (0x3FB8 * 8 + 4)
#define                                 T0MD16_bit          _BIT_ACCESS(T0CON0,4)
// T0CON0<T0OUT>
extern volatile __bit                   T0OUT               __at(0x1FDC5);	// @ (0x3FB8 * 8 + 5)
#define                                 T0OUT_bit           _BIT_ACCESS(T0CON0,5)
// TMR0H<T0PR0>
extern volatile __bit                   T0PR0               __at(0x1FDB8);	// @ (0x3FB7 * 8 + 0)
#define                                 T0PR0_bit           _BIT_ACCESS(TMR0H,0)
// TMR0H<T0PR1>
extern volatile __bit                   T0PR1               __at(0x1FDB9);	// @ (0x3FB7 * 8 + 1)
#define                                 T0PR1_bit           _BIT_ACCESS(TMR0H,1)
// TMR0H<T0PR2>
extern volatile __bit                   T0PR2               __at(0x1FDBA);	// @ (0x3FB7 * 8 + 2)
#define                                 T0PR2_bit           _BIT_ACCESS(TMR0H,2)
// TMR0H<T0PR3>
extern volatile __bit                   T0PR3               __at(0x1FDBB);	// @ (0x3FB7 * 8 + 3)
#define                                 T0PR3_bit           _BIT_ACCESS(TMR0H,3)
// TMR0H<T0PR4>
extern volatile __bit                   T0PR4               __at(0x1FDBC);	// @ (0x3FB7 * 8 + 4)
#define                                 T0PR4_bit           _BIT_ACCESS(TMR0H,4)
// TMR0H<T0PR5>
extern volatile __bit                   T0PR5               __at(0x1FDBD);	// @ (0x3FB7 * 8 + 5)
#define                                 T0PR5_bit           _BIT_ACCESS(TMR0H,5)
// TMR0H<T0PR6>
extern volatile __bit                   T0PR6               __at(0x1FDBE);	// @ (0x3FB7 * 8 + 6)
#define                                 T0PR6_bit           _BIT_ACCESS(TMR0H,6)
// TMR0H<T0PR7>
extern volatile __bit                   T0PR7               __at(0x1FDBF);	// @ (0x3FB7 * 8 + 7)
#define                                 T0PR7_bit           _BIT_ACCESS(TMR0H,7)
// T1CON<T1CKPS0>
extern volatile __bit                   T1CKPS0             __at(0x1FD94);	// @ (0x3FB2 * 8 + 4)
#define                                 T1CKPS0_bit         _BIT_ACCESS(T1CON,4)
// T1CON<T1CKPS1>
extern volatile __bit                   T1CKPS1             __at(0x1FD95);	// @ (0x3FB2 * 8 + 5)
#define                                 T1CKPS1_bit         _BIT_ACCESS(T1CON,5)
// T1CLK<T1CS0>
extern volatile __bit                   T1CS0               __at(0x1FDA8);	// @ (0x3FB5 * 8 + 0)
#define                                 T1CS0_bit           _BIT_ACCESS(T1CLK,0)
// T1CLK<T1CS1>
extern volatile __bit                   T1CS1               __at(0x1FDA9);	// @ (0x3FB5 * 8 + 1)
#define                                 T1CS1_bit           _BIT_ACCESS(T1CLK,1)
// T1CLK<T1CS2>
extern volatile __bit                   T1CS2               __at(0x1FDAA);	// @ (0x3FB5 * 8 + 2)
#define                                 T1CS2_bit           _BIT_ACCESS(T1CLK,2)
// T1CLK<T1CS3>
extern volatile __bit                   T1CS3               __at(0x1FDAB);	// @ (0x3FB5 * 8 + 3)
#define                                 T1CS3_bit           _BIT_ACCESS(T1CLK,3)
// T1CLK<T1CS4>
extern volatile __bit                   T1CS4               __at(0x1FDAC);	// @ (0x3FB5 * 8 + 4)
#define                                 T1CS4_bit           _BIT_ACCESS(T1CLK,4)
// T1GCON<T1GE>
extern volatile __bit                   T1GE                __at(0x1FD9F);	// @ (0x3FB3 * 8 + 7)
#define                                 T1GE_bit            _BIT_ACCESS(T1GCON,7)
// T1GCON<T1GGO>
extern volatile __bit                   T1GGO               __at(0x1FD9B);	// @ (0x3FB3 * 8 + 3)
#define                                 T1GGO_bit           _BIT_ACCESS(T1GCON,3)
// T1GCON<T1GPOL>
